/* 
ბესი მუშაობს დიდ N (1<=N<=2,000,000,000) რიცხვებთან. მაგალითად, 153920529. ბესის ესმის, რომ რიცხვების წაკითხვა უფრო ადვილია, თუ მას, მარჯვნიდან მარცხნივ, დავყოფთ სამციფრიან ჯგუფებად: 153,920,529.

დაწერეთ პროგრამა, რომელი გააკეთებს მძიმეების ჩამატებას რიცხვში.

შესატანი მონაცემები: ერთი მთელი რიცხვი – N.

გამოსატანი მონაცემები: ერთი მთელი რიცხვი – N, რომელიც მძიმეებით დაყოფილია სამციფრიან ჯგუფებად. */

#include <iostream>
#include <string>
using namespace std;
int main()
{
    string a;
    int i; 
    cin >> a;
     for(i  = a.size() - 3; i > 0; i = i -3)
    {
        a.insert(i, ",");
    }
    cout << a;
   
}
