/* 
მოცემულია სიტყვა, რომლის სიგრძე არ აღემატება 100-ს. დაწერეთ პროგრამა, რომელიც გამოითვლის, თუ რამდენჯერ შედის მოცემული სიმბოლო ამ სიტყვაში.

შესატანი მონაცემები: პირველ სტრიქონში - მთავრული ლათინური სიმბოლოებით შედგენილი ერთი სიტყვა, მეორე სტრიქონში - ერთი სიმბოლო.

გამოსატანი მონაცემები: რაოდენობა, რამდენჯერაც მოცემულ სიტყვაში გვხვდება მოცემული სიმბოლო. */

#include <iostream>
#include <string>
using namespace std;
    int i, j; 
string a;
char b;
int main()
{
    cin >> a >> b;

    for(j = 0; j < a.size(); j++)
        {
            if(a[j] == b)
            i++;
        }
    cout << i;
   
}
