/* მოცემულია ფეხბურთის მატჩის ოქმი, რომლის პირველ სტრიქონში აღნიშნულია ორივე გუნდის მიერ ჯამურად გატანილი გოლების რაოდენობა, ხოლო მეორე სტრიქონში – თუ რომელ წუთზე გავიდა გოლები. დაადგინეთ, რომელ ტაიმში გავიდა მეტი გოლი.

შესატანი მონაცემები: პირველ სტრიქონში მოცემულია მატჩში გატანილი გოლების რაოდენობა N (1<N<20). მეორე სტრიქონში მოცემულია N ცალი რიცხვი – 1–დან 90–მდე. ტაიმი 45 წუთს გრძელდება.

გამოსატანი მონაცემები: FIRST – თუ პირველ ტაიმში გავიდა მეტი გოლი,  SECOND – თუ მეორე ტაიმში გავიდა მეტი გოლი,   BOTH – თუ ორივე ტაიმში თანაბრად გაიტანეს. */ 

#include <iostream>
using namespace std;
int a,b,c,d;
main()
{
    cin>>a;
    for (int i=0;i<a;i++){
        cin>>b;
        if (b<=45) c++;
        else d++;
    }
    if (c>d) cout<<"FIRST"; 
    else if (d>c) cout<<"SECOND"; 
    else cout<<"BOTH";
}
