
/* პალინდრომი ეწოდება ისეთ სიტყვას, რომელიც ერთნაირად იკითხება წინიდან და უკნიდან. მაგალითად, სიტყვა deed პალინდრომია, ხოლო სიტყვა read – არა. დაწერეთ პროგრამა, რომელიც გაარკვევს, პალინდრომია თუ არა მოცემული სიტყვა.

შესატანი მონაცემები: ლათინური მთავრული ასოებისაგან შედგენილი სიტყვა, რომლის სიგრძეც არ აღემატება 254 სიმბოლოს. 

გამოსატანი მონაცემები: YES – თუ შემომავალი მონაცემი პალინდრომია და NO– წინააღმდეგ შემთხვევაში. */


#include <iostream>
#include <string>
using namespace std;
int main()
{
    int j;
    int x = 0, p;
    string a;
    cin >> a;

    for(j = 0; j < a.size()/2; j++)
        {
            if(a[j] != a[a.size() - j -1])
            x =1;
        }
        if(x == 0)
        cout << "YES";
        else
        cout << "NO";
}
