/* ოთხი მოსწავლე აპირებს საქანელაზე გაერთოს. საქანელას თითოეულ მხარეს ორ-ორი მოსწავლე უნდა დაჯდეს. მათ სურთ, რომ განსხვავება ცალკეულ მხარეს მყოფ მოსწავლეთა ჯამურ წონებს შორის მინიმალური იყოს. დაწერეთ პროგრამა, რომელიც ამ ამოცანას გადაწყვეტს.

შესატანი მონაცემები: ოთხი მთელი რიცხვი a, b,  c და d - მოსწავლეთა წონები.

გამოსატანი მონაცემები: ერთი მთელი რიცხვი - მინიმალური განსხვავება მხარეთა ჯამურ წონებს შორის.
 */
#include <iostream>
#include <algorithm>
#include <vector>
using namespace std;

int main()
{
    vector<int> a;
    int i = 0;
    int k = 0;
    int p = 0;
    while (cin >> k)
    {
        a.push_back(k);
        i++;
    }
    sort(a.begin(), a.end());
    p = abs(a[0] + a[3] - (a[1] + a[2]));
    cout << p;
    i++;    
}
