/* 
მოცემულია სიტყვა, რომლის სიგრძე არ აღემატება 100 სიმბოლოს. დაწერეთ პროგრამა, რომელიც გამოიტანს ამ სიტყვის შუა სიმბოლოს, თუ სიტყვაში კენტი რაოდენობის სიმბოლოა. ლუწი რაოდენობის სიმბოლოს შემთხვევაში გამოიტანეთ შუა ორი სიმბოლო.

შესატანი მონაცემები: ერთადერთი სტრიქონში ერთი სიტყვა, რომელიც შედგენილია ლათინური სიმბოლოებისაგან.

გამოსატანი მონაცემები: სიტყვის შუაში მდებარე ერთი ან ორი სიმბოლო. */

#include <iostream>
#include <string>
using namespace std;
int main()
{
    string a;
   cin >> a;
    if (a.size() % 2 == 1)
    cout << a[a.size() / 2];
    else 
    {
    cout << a[a.size() / 2 - 1];
    cout << a[a.size() / 2];
    } 
}
